app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
        <p class="card-text">City user: <%= @gossip.user.city.name %></p>
   			<%= link_to "#{@gossip.user.first_name}", user_path(@gossip.user.id) %>