app/views/city/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."city_id" = $1  [["city_id", 4]]
---
    </div>
    <% @city.users.each do |go| %>