app/controllers/gossips_controller.rb

	def index
		@gossip = Gossip.find(params[:gossip_id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def show
	    # Méthode qui récupère le potin concerné et l'envoie à la view show (show.html.erb) pour affichage
	   @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
	    # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
	    # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
	    # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)
	     @gossip = Gossip.new(title: params[:title], content: params[:content], user_id: 11) # avec xxx qui sont les données obtenues à partir du formulaire

		  if @gossip.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "zaza"], ["content", "ffffffffffffffffffffffffffffffff"], ["user_id", 11], ["created_at", "2019-08-12 12:54:02.413332"], ["updated_at", "2019-08-12 12:54:02.413332"]]

	def edit
	    # Méthode qui récupère le potin concerné et l'envoie à la view edit (edit.html.erb) pour affichage dans un formulaire d'édition
	    @gossip = Gossip.find(params[:id ])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
	    # Méthode qui met à jour le potin à partir du contenu du formulaire de edit.html.erb, soumis par l'utilisateur
	    # pour info, le contenu de ce formulaire sera accessible dans le hash params
	    # Une fois la modification faite, on redirige généralement vers la méthode show (pour afficher le potin modifié)
	    @gossip = Gossip.find(params[:id])
  if @gossip.update(title: params[:title], content: params[:content], user_id: 11)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "user_id" = $3, "updated_at" = $4 WHERE "gossips"."id" = $5  [["title", "aaaaaaaaa"], ["content", "buse they can't be typed on his binary keyboard."], ["user_id", 11], ["updated_at", "2019-08-09 04:21:05.164637"], ["id", 8]]

	def destroy
	    # Méthode qui récupère le potin concerné et le détruit en base
	    # Une fois la suppression faite, on redirige généralement vers la méthode index (pour afficher la liste à jour)
	     @gossip = Gossip.find(params[:id])

	      if @gossip.comments != nil
	      	@gossip.comments.each do |s|
 				s.destroy
 			end
 			end
  if @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 27]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 6]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 23]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 25]]