app/controllers/users_controller.rb

 	def create
 		if params[:p1] == params[:p2]
 		@user = User.create(first_name: params[:fn], last_name: params[:ln], description: params[:d], city_id: params[:c], password: params[:p1])
---
INSERT INTO "users" ("first_name", "last_name", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"