app/views/accueil/index.html.erb

          <div class="well">
           <p><p><%= gossip.user.first_name %></p></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]